[
    {
        "id": 0,
        "title": "Odit et ipsam.",
        "subTitle": "Totam voluptatem aut autem laudantium inventore at voluptate. Tempore veritatis ut fugit qui eos expedita.",
        "createdDate": "Tue Oct 24 2023 23:55:55 GMT+0800 (Taipei Standard Time)",
        "content": "Qui et eos officiis aut occaecati odio libero reprehenderit. Dicta quasi ad quas eum atque deserunt consequatur ea. Provident nam dicta qui. Omnis ut dolorem blanditiis fugit et minus repellat et exercitationem.\n \rAspernatur aliquid quo dolore id similique corporis qui quos. Ut nulla suscipit in a quis similique itaque consectetur non. Non veritatis nesciunt vel aliquid optio sit blanditiis ipsum. Distinctio nisi eos velit magnam nam quis quaerat et. Quis consequatur id quaerat voluptatibus odit ducimus accusantium iusto. Officiis quis debitis fuga earum suscipit cupiditate et.\n \rNostrum ducimus eos et enim occaecati qui voluptas sapiente non. Asperiores doloremque dolor veritatis debitis in perspiciatis. Dolorem sit quia aut eos nihil. Sed officia et accusamus nostrum aut doloremque perspiciatis eligendi. Quis ex non autem quis. Ipsa perspiciatis est eum nam aut consequatur ut rerum officiis.",
        "publish": true,
        "url": "articles/0",
        "image": "/static/image/article-img-0.jpg"
    },
    {
        "id": 1,
        "title": "Neque excepturi ab facere labore sint pariatur quia.",
        "subTitle": "A voluptate numquam aperiam dolores perferendis in. Placeat id voluptatem distinctio sed distinctio velit aut.",
        "createdDate": "Wed Dec 27 2023 23:03:43 GMT+0800 (Taipei Standard Time)",
        "content": "Itaque in ullam recusandae doloribus. Dolores tempore dolores commodi adipisci corrupti autem dolor reiciendis ut. Qui tempore molestiae aut consequatur non vel.\n \rCumque aliquid est delectus culpa amet blanditiis. Eos expedita inventore atque perferendis eum odio. Cum est quia.\n \rQuidem autem dolor inventore ut nisi sint omnis quod eos. Tenetur non eaque vero earum vel blanditiis et. Earum dolores harum nam. Itaque assumenda quos. Saepe rem quas minus quia adipisci reprehenderit.",
        "publish": true,
        "url": "articles/1",
        "image": "/static/image/article-img-1.jpg"
    },
    {
        "id": 2,
        "title": "Strongest Versions Of Red In Pokemon Games & Manga",
        "subTitle": "Trainer Red appears in the Pokemon Ultra Sun and Moon battle tree. Spearheaded by Red and his counterpart, Blue, the battle tree is only accessible after players defeat the game's elite four. After defeating numerous consecutive trainers in the battle facility, Red and Blue can be challenged.",
        "createdDate": "Thu Feb 29 2024 02:09:45 GMT+0800 (Taipei Standard Time)",
        "content": "The Pokemon trainer Red is perhaps the most famous protagonist in the series, second only to the anime's Ash Ketcham. Labore doloremque et. Voluptas voluptatibus labore laudantium repellendus accusantium veniam culpa. Sit magni voluptas odit.\n \rThe famed Pokemon trainer has long been considered the most powerful Pokemon trainer of all time, though with multiple versions of this iconic Pokemon master appearing throughout the franchise, it begs the question: which one is the very best?\n \rReiciendis sed deleniti vel sunt. Quisquam et laborum omnis. Placeat et laborum et perferendis consectetur esse voluptates autem omnis. Voluptatem ea cum. Deserunt numquam voluptate laborum dolorem deleniti illum sunt sit eius. Tenetur delectus voluptates est ut culpa ipsam doloribus.",
        "publish": true,
        "url": "articles/2",
        "image": "/static/image/article-img-2.jpg",
        "updatedDate": "Tue Oct 01 2024 14:24:27 GMT+0800 (Taipei Standard Time)"
    },
    {
        "id": 3,
        "title": "Rerum et explicabo temporibus.",
        "subTitle": "Similique non totam quo alias facilis eveniet fugit. Voluptate quos quaerat. Sit in omnis quo. Optio unde nemo rerum et reprehenderit ex enim libero. Dolor officiis alias ut itaque. Nesciunt beatae velit quia.",
        "createdDate": "Thu Feb 01 2024 17:01:47 GMT+0800 (Taipei Standard Time)",
        "content": "Repellat iste at hic laborum unde praesentium velit. Et nihil perspiciatis quasi quisquam. Excepturi qui voluptatum voluptatem molestias alias nesciunt.\n \rEius quia non omnis adipisci nobis. Necessitatibus molestiae illum repellat dolore quibusdam sed hic dolorum id. Odit beatae consectetur explicabo deserunt impedit enim. Ad eveniet possimus quam tenetur amet cumque fugiat eveniet.\n \rSoluta inventore voluptas aperiam. Id fugiat accusamus velit porro aut. Assumenda enim architecto aut voluptatem nam. Animi vitae eos. Perspiciatis et omnis. Illo harum aliquam fugiat sint iure hic in aliquid voluptatem.",
        "publish": true,
        "url": "articles/3",
        "image": "/static/image/article-img-3.jpg"
    },
    {
        "id": 4,
        "title": "Aut nihil perferendis quia dolorum explicabo.",
        "subTitle": "Voluptas ipsum accusamus qui porro reiciendis sequi esse. Qui aliquam deserunt pariatur. Omnis et illum perferendis ut eaque sed excepturi dolorem.",
        "createdDate": "Thu Jul 11 2024 00:45:19 GMT+0800 (Taipei Standard Time)",
        "content": "Veritatis ad ad magni corrupti explicabo quis. Laboriosam id corrupti id placeat deleniti hic ut repudiandae harum. Earum nihil dolore non autem enim quo ut.\n \rEum qui ipsa fuga libero voluptatem et quidem magnam sapiente. Ut soluta quia ut dolore ratione. Quia perspiciatis et. Sint quisquam ipsam at minus placeat sunt dolor ex molestiae. Voluptatum molestiae molestiae natus.\n \rIllum qui consequatur ut. Consectetur aperiam molestiae perferendis ut recusandae pariatur. Quis saepe et. Aut error natus esse et magnam hic. Nemo perferendis aliquam et atque vitae reiciendis enim harum. Id numquam fuga ad perspiciatis temporibus.",
        "publish": false,
        "url": "articles/4",
        "image": "/static/image/article-img-4.jpg",
        "delete": true,
        "deletedDate": "Tue Oct 01 2024 14:34:29 GMT+0800 (Taipei Standard Time)"
    },
    {
        "id": 5,
        "title": "Dolor magni sed et quisquam sit dolor sunt iure laudantium.",
        "subTitle": "Modi sunt dolores illo aspernatur. Sed vitae velit earum odio voluptatem. Dolores consequatur quo iste atque aut iusto totam. Voluptate qui neque et id et molestiae ex.",
        "createdDate": "Wed Dec 20 2023 18:50:30 GMT+0800 (Taipei Standard Time)",
        "content": "Repudiandae et iste consequatur optio ad ut tempore et expedita. Aperiam voluptates facilis est amet hic inventore est cum et. Ut eaque earum et iusto accusamus molestiae placeat molestias. Sapiente commodi et qui minima dolores. Et tenetur et reprehenderit.\n \rId quia numquam repudiandae. Quia molestiae aperiam autem sit et dolores sequi reprehenderit. Provident in aliquid quia necessitatibus suscipit facere omnis fuga a. Earum ut consequatur ipsam consequuntur ut. Et labore dolorem distinctio soluta quibusdam quo non ut quis. Magnam consectetur ex magnam rerum accusamus ut.\n \rIure necessitatibus eos tenetur sint consectetur. Eius accusantium illo nostrum reprehenderit inventore consequatur culpa. Numquam tempore odio sapiente voluptas aut adipisci.",
        "publish": true,
        "url": "articles/5",
        "image": "/static/image/article-img-5.jpg"
    },
    {
        "id": 6,
        "title": "Fugit et quod dolorem eos perspiciatis exercitationem et quos.",
        "subTitle": "Voluptatum aut sed ut. Autem perferendis hic culpa molestiae. Deleniti sunt qui corrupti sequi quia.",
        "createdDate": "Sun Jul 21 2024 14:20:03 GMT+0800 (Taipei Standard Time)",
        "content": "Ducimus sint eos. Autem ipsum occaecati eum rerum assumenda rem. Laudantium aperiam numquam quae quis.\n \rVoluptatem rerum velit ipsam est eum recusandae magni est est. Repellendus et saepe quia dicta. Sed fugit ipsam aut sunt praesentium blanditiis tempore. Dolorum iusto iste repudiandae modi rem est laudantium dolores et.\n \rEius quibusdam repellat eum. Praesentium nemo eius ut reprehenderit. Quis mollitia iusto delectus id omnis enim velit voluptas ex. Nesciunt veniam optio at quaerat quia impedit.",
        "publish": true,
        "url": "articles/6",
        "image": "/static/image/article-img-6.jpg"
    },
    {
        "id": 7,
        "title": "New Article Posted",
        "subTitle": "It is a testing POST API call.",
        "createdDate": "Tue Oct 01 2024 13:55:13 GMT+0800 (Taipei Standard Time)",
        "content": "So as I said, it works, right? This is so amazing.",
        "image": "/static/image/article-img-7.jpg",
        "url": "/articles/7",
        "publish": true
    }
]